<a href="https://colab.research.google.com/github/hazra-kerubo/DescriptiveAnalysis/blob/main/FranceBlueCars.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#importing python libraries
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import random
random.seed(100)

In [2]:
# loading dataset
data=pd.read_csv('/content/autolib_daily_events_postal_code.csv')
data.head

<bound method NDFrame.head of        Postal code       date  ...  Slots_freed_sum  Slots_taken_sum
0            75001   1/1/2018  ...               22               20
1            75001   1/2/2018  ...               23               22
2            75001   1/3/2018  ...               27               27
3            75001   1/4/2018  ...               25               21
4            75001   1/5/2018  ...               18               20
...            ...        ...  ...              ...              ...
16080        95880  6/15/2018  ...                0                0
16081        95880  6/16/2018  ...                0                0
16082        95880  6/17/2018  ...                0                0
16083        95880  6/18/2018  ...                0                0
16084        95880  6/19/2018  ...                0                0

[16085 rows x 13 columns]>

In [3]:
data=pd.read_csv('/content/autolib_daily_events_postal_code.csv')
data.tail

<bound method NDFrame.tail of        Postal code       date  ...  Slots_freed_sum  Slots_taken_sum
0            75001   1/1/2018  ...               22               20
1            75001   1/2/2018  ...               23               22
2            75001   1/3/2018  ...               27               27
3            75001   1/4/2018  ...               25               21
4            75001   1/5/2018  ...               18               20
...            ...        ...  ...              ...              ...
16080        95880  6/15/2018  ...                0                0
16081        95880  6/16/2018  ...                0                0
16082        95880  6/17/2018  ...                0                0
16083        95880  6/18/2018  ...                0                0
16084        95880  6/19/2018  ...                0                0

[16085 rows x 13 columns]>

In [4]:
# reading columns explanation
columns_explanation=pd.read_excel('/content/columns_explanation.xlsx')
columns_explanation

               Column name                                        explanation
0              Postal code                 postal code of the area (in Paris)
1                     date                        date of the row aggregation
2      n_daily_data_points  number of daily data poinst that were availabl...
3                dayOfWeek     identifier of weekday (0: Monday -> 6: Sunday)
4                 day_type                                 weekday or weekend
5       BlueCars_taken_sum    Number of bluecars taken that date in that area
6    BlueCars_returned_sum  Number of bluecars returned that date in that ...
7         Utilib_taken_sum      Number of Utilib taken that date in that area
8      Utilib_returned_sum   Number of Utilib returned that date in that area
9      Utilib_14_taken_sum  Number of Utilib 1.4 taken that date in that area
10  Utilib_14_returned_sum  Number of Utilib 1.4 returned that date in tha...
11         Slots_freed_sum  Number of recharging slots released that date ...
12         Slots_taken_sum  Number of rechargign slots taken that date in ...

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16085 entries, 0 to 16084
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Postal code             16085 non-null  int64
 1   date                    16085 non-null  object
 2   n_daily_data_points     16085 non-null  int64
 3   dayOfWeek               16085 non-null  int64
 4   day_type                16085 non-null  object
 5   BlueCars_taken_sum      16085 non-null  int64
 6   BlueCars_returned_sum   16085 non-null  int64
 7   Utilib_taken_sum        16085 non-null  int64
 8   Utilib_returned_sum     16085 non-null  int64
 9   Utilib_14_taken_sum     16085 non-null  int64
 10  Utilib_14_returned_sum  16085 non-null  int64
 11  Slots_freed_sum         16085 non-null  int64
 12  Slots_taken_sum         16085 non-null  int64
dtypes: int64(11), object(2)
memory usage: 1.6+ MB

In [6]:
data['Postal code'].unique()

array([75001, 75002, 75003, 75004, 75005, 75006, 75007, 75008, 75009,
       75010, 75011, 75012, 75013, 75014, 75015, 75016, 75017, 75018,
       75019, 75020, 75112, 75116, 78000, 78140, 78150, 91330, 91370,
       91400, 92000, 92100, 92110, 92120, 92130, 92140, 92150, 92160,
       92170, 92190, 92200, 92210, 92220, 92230, 92240, 92250, 92260,
       92270, 92290, 92300, 92310, 92320, 92330, 92340, 92350, 92360,
       92370, 92380, 92390, 92400, 92410, 92420, 92500, 92600, 92700,
       92800, 93100, 93110, 93130, 93150, 93170, 93200, 93230, 93260,
       93300, 93310, 93350, 93360, 93370, 93390, 93400, 93440, 93500,
       93600, 93700, 93800, 94000, 94100, 94110, 94120, 94130, 94140,
       94150, 94160, 94220, 94230, 94300, 94340, 94410, 94450, 94500,
       94700, 94800, 95100, 95870, 95880])

In [7]:
# Hypothesis on blue cars
# The number of blue cars returned in areas 75001,94700,95880,92200 is different from the number of blue cars in areas
#  the number of blue cars returned in areas 75011,92310,94450,92168, is the same

In [8]:
#Formulating hypothesis
#Null hypothesis
#H0 There is no difference in the no of blue cars returned on weekdays in areas [75001,94700,95880,92200,]
#is different from the number of blue cars returned in areas [75011,92310,94450,92168]
# Alternative hypothesis
#H1 There is a difference in the no of blue cars returned on weekdays in areas [75001,94700,95880,92200,]
# and number of blue cars returned in areas [75011,92310,94450,92168]

In [9]:
data_new = data[(data['day_type']=='weekday')].copy()

In [10]:
data_new.head()

   Postal code      date  ...  Slots_freed_sum  Slots_taken_sum
0        75001  1/1/2018  ...               22               20
1        75001  1/2/2018  ...               23               22
2        75001  1/3/2018  ...               27               27
3        75001  1/4/2018  ...               25               21
4        75001  1/5/2018  ...               18               20

[5 rows x 13 columns]

In [11]:
data_final = data_new[(data_new['Postal code']== 75001) | (data_new['Postal code']== 94700)|
(data_new['Postal code']==95880) | (data_new['Postal code']==92220) |
(data_new['Postal code']==75011) | (data_new['Postal code']==92310) |
(data_new['Postal code']==94450) | (data_new['Postal code']==92160)].copy()

In [12]:
data_final.shape

(896, 13)

In [13]:
# dropping unwanted columns
#removing unwanted columns
data_final.drop(['BlueCars_taken_sum','Utilib_taken_sum','Utilib_returned_sum','Utilib_14_taken_sum','Utilib_14_returned_sum',
'Slots_freed_sum','Slots_taken_sum','n_daily_data_points','dayOfWeek','date'],axis=1,inplace=True)

In [14]:
data_final.shape

(896, 3)

In [15]:
data_final.head()

   Postal code day_type  BlueCars_returned_sum
0        75001  weekday                    103
1        75001  weekday                     94
2        75001  weekday                    139
3        75001  weekday                    104
4        75001  weekday                    117

In [16]:
#75001,94700,95880,92220
#75011,92310,94450,92160,

In [17]:
group1=data_final[(data_new['Postal code']==75001) | (data_new['Postal code']==94700)|(data_new['Postal code']==95880)|
(data_new['Postal code']==92220)]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [18]:
group2=data_final[(data_new['Postal code']==75011) | (data_new['Postal code']==92310)|(data_new['Postal code']==94450)|
(data_new['Postal code']==92160)]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [19]:
group1.head()

   Postal code day_type  BlueCars_returned_sum
0        75001  weekday                    103
1        75001  weekday                     94
2        75001  weekday                    139
3        75001  weekday                    104
4        75001  weekday                    117

In [20]:
group1.shape

(448, 3)

In [21]:
group2.head()

      Postal code day_type  BlueCars_returned_sum
1560        75011  weekday                    513
1561        75011  weekday                    384
1562        75011  weekday                    424
1563        75011  weekday                    398
1564        75011  weekday                    454

In [22]:
group2.shape

(448, 3)

In [23]:
# sampling
sample_1= group1.sample(n = 300, replace="False")
sample_2= group2.sample(n = 300, replace="False")

In [24]:
sample_1

       Postal code day_type  BlueCars_returned_sum
15313        94700  weekday                     29
15365        94700  weekday                     32
37           75001  weekday                     99
15950        95880  weekday                      9
6267         92220  weekday                     55
...            ...      ...                    ...
16072        95880  weekday                     11
120          75001  weekday                    130
123          75001  weekday                    115
15375        94700  weekday                     19
6314         92220  weekday                     58

[300 rows x 3 columns]

In [25]:
sample_2

       Postal code day_type  BlueCars_returned_sum
1707         75011  weekday                    561
5457         92160  weekday                     34
1688         75011  weekday                    394
1617         75011  weekday                    463
7580         92310  weekday                     52
...            ...      ...                    ...
1627         75011  weekday                    404
5461         92160  weekday                     26
7508         92310  weekday                     54
14996        94450  weekday                     10
7520         92310  weekday                     46

[300 rows x 3 columns]

In [29]:
X_b=abs( sample_1['BlueCars_returned_sum'].mean() - sample_2['BlueCars_returned_sum'].mean())

In [30]:
X_b

88.12333333333332

In [34]:
# sample var
sample_variance=sample_1['BlueCars_returned_sum'].var() + sample_2['BlueCars_returned_sum'].var()

In [38]:
# sample std
sample_std=np.sqrt(sample_variance)
print(sample_std)

191.09050751523569

In [45]:
#sampling error= std dev divide by sqtr of n
sampling_error=sample_std/np.sqrt(300)
print(sampling_error)

11.032615595350352

In [49]:
#calculating z score

Z_score= X_b / sampling_error
print(Z_score)

7.987528666409125

In [50]:
# 
from scipy.stats import norm

norm.cdf(Z_score)

0.9999999999999993

In [51]:
# pvalue
p_value=1-norm.cdf(Z_score)

In [52]:
p_value

6.661338147750939e-16

In [53]:
# alpha value = 0.05

#Conclusion
#The p value is less than the alpha value hence we reject the null hypothesis
##H0 There is no difference in the no of blue cars returned on weekdays in areas [75001,94700,95880,92200]
#is different from the number of blue cars returned in areas [75011,92310,94450,92168]